Revit 2027 API
Rebar.IncludeFirstBar Property
 Identifies if the first bar in rebar set is shown.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IncludeFirstBar { get; set; }
Public Property IncludeFirstBar As Boolean
	Get
	Set
public:
property bool IncludeFirstBar {
	bool get ();
	void set (bool value);
}
member IncludeFirstBar : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InapplicableDataException |  This rebar element represents a single bar (the layout rule is Single).
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace